#Задача №3467. Парты
# В некоторой школе решили набрать три новых математических класса и оборудовать
# кабинеты для них новыми партами. За каждой партой может сидеть два учащихся.
# Известно количество учащихся в каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
#Входные данные
#Программа получает на вход три натуральных числа: количество учащихся в
# каждом из трех классов (числа не превышают 1000).
#Выходные данные
#Выведите ответ на задачу.

a = int(input())
b = int(input())
c = int(input())
print(a // 2 + b // 2 + c // 2 + a % 2 + b % 2 + c % 2)
